; Функция Аккермана

(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))
               
(A 1 10) ; => 1024
(A 2 4) ; => 65536
(A 3 3) ; => 65536

(define (f n) (A 0 n)) ; Аналог математической функции f(n) = 2n
(f 100)

(define (g n) (A 1 n)) ; Аналог математической функции f(n) = 2^n
(g 6)

(define (h n) (A 2 n)) ; Аналог математической функции f(n) = 2^f(n-1), т.е f(5) = 2^65536
(h 4)

;(define (k n) (* 5 n n))